app/controllers/home_controller.rb

    def index

      if user_signed_in? && current_user.isStylist?
        redirect_to user_dashboard_path(current_user)

      else
        if  user_signed_in? && current_user.isAdmin?
          redirect_to dashboard_path
        else
        @alert = params[:alert] if !params[:alert].blank?
        @errors = params[:errors] if !params[:errors].blank?
        @confirmed = params[:confirm] if !params[:confirm].blank?
        #@services= Service.select(:name).uniq
        @availabilities = Availability::TIMEOBJ
        gon.service_names= getServiceNameList()
        @popular_services=PopularService.order(:id)
        @recently_booked=RecentlyBooked.order(:id)
        @featured_professional=FeaturedProfessional.order(:id)
---
SELECT `popular_services`.* FROM `popular_services`  ORDER BY `popular_services`.`id` ASC
SELECT `recently_bookeds`.* FROM `recently_bookeds`  ORDER BY `recently_bookeds`.`id` ASC
SELECT `featured_professionals`.* FROM `featured_professionals`  ORDER BY `featured_professionals`.`id` ASC