app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `bookings`.* FROM `bookings` WHERE `bookings`.`stylist_id` = 2
---
  def dashboard

    @user=User.find(params[:user_id])
    if current_user.isStylist?
    @booking_history={}
     #@transactions=Transaction.where(:user_id=>current_user.id,:is_deleted=>false)
      #transaction=Transaction.where(:stylist_id=> current_user.id,:is_deleted=>false,:transaction_status=>"submitted_for_settlement")
      bookings=Booking.where(:stylist_id => current_user.id,:is_confirmed => true)